Repository: MsRapunzel/angular-labs
Catalog: src/locale/messages.*.xlf
Languages: fr, uk

source: About component works!
fr: Le composant "Qui nous sommes" fonctionne!
uk: Компонент "Про нас" працює!

# welcomeTitle
source: Welcome to {{ title }}!
fr: Bienvenue à {{ title }}!
uk: Вітаємо в {{ title }}!

# welcomeParagraph
source: This is the starter webpage edited by 408 cohort student Anastasiia Zolotova. 🎉
fr: Ceci est la page web de démarrage éditée par 408 cohorte étudiante Anastasiia Zolotova. 🎉
uk: Це стартова вебсторінка, яку було віредаговано студенткою 408 групи Анастасією Золотовою. 🎉

source: Child component
fr: Le composant enfant
uk: Дочірній компонент

source: Received data: {{ data }}
fr: Données reçues: {{ data }}
uk: Отримані дані: {{ data }}

source: Description component works!
fr: Le composant "Description" fonctionne!
uk: Компонент "Опис" працює!

source: First component
fr: Le premier composant
uk: Перший компонент

source: Change state
fr: Changer d'état
uk: Змінити стан

source: Parent component
fr: Le composant parent
uk: Батьківський компонент

source: Sending data to child component:
fr: Envoyer des données aux composant enfant:
uk: Надсилання інформації до дочірнього компонента:

source: Hello from parent component!
fr: Bonjour de composant parent!
uk: Привіт з батьківського компонента!

source: Reactive Form with Nested FormGroups
fr: Reactive Form avec imbriqué Form Groups
uk: Reactive Form з вбудованими Form Groups

source: Personal Info
fr: Informations personnelles
uk: Особиста інформація

source: First Name:
fr: Prénom
uk: Ім'я

source: First name is required.
fr: Le prénom est requis.
uk: Ім'я обов'язкове

source: First name must be at least 2 characters.
fr: Le prénom doit avoir 2 caractères au minimum.
uk: Ім'я має складатися з принаймні 2 символів

source: Last Name:
fr: Nom de famille:
uk: Прізвище

source: Last name is required.
fr: Nom de famille est requis.
uk: Прізвище обов'язкове

source: Last name must be at least 2 characters.
fr: Nom de famille doit avoir 2 caractères au minimum.
uk: Прізвище має складатися з принаймні 2 символів

source: Address
fr: Adresse
uk: Адреса

source: City:
fr: Ville:
uk: Місто:

source: City is required.
fr: Ville est requis.
uk: Місто обов'язкове

source: Postal Code:
fr: Code Postal:
uk: Поштовий індекс:

source: Postal code is required.
fr: Postal Code est requis.
uk: Поштовий індекс обов'язковий

source: Postal code must be 5 digits.
fr: Code postal doit être composé de 5 chiffres.
uk: Поштовий індекс має складатися з 5 цифр

source: Contact
uk: Контактна інформація

source: Email is required.
fr: Email est requis.
uk: Email обов'язковий

source: Invalid email format.
fr: Format d'adresse électronique incorrect.
uk: Некоректний формат email

source: Phone:
fr: Numéro:
uk: Телефон:

source: Phone number is required.
fr: Numéro est requis.
uk: Телефон обов'язковий

source: Update Form
fr: Mise à jour
uk: Оновити форму

source: Reset Form
fr: Réinitialiser
uk: Скинути форму

source: Form Values
fr: Valeurs de formulaire
uk: Значення форми

source: third works!
fr: Le troisième composant fonctionne!
uk: Третій компонент працює!
